SELECT Н_ЛЮДИ.ИД, Н_СЕССИЯ.УЧГОД
FROM Н_ЛЮДИ
RIGHT JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ФАМИЛИЯ = 'Афанасьев'
AND Н_СЕССИЯ.ИД != 14;

SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.НАЧАЛО
FROM Н_ЛЮДИ
LEFT JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
LEFT JOIN Н_ОБУЧЕНИЯ USING ("ЧЛВК_ИД")
WHERE Н_ЛЮДИ.ФАМИЛИЯ > 'Афанасьев'
AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД = 112514;

SELECT COUNT(*) FROM
(SELECT ОТЧЕСТВО FROM Н_ЛЮДИ WHERE ОТЧЕСТВО ~'^[А-Я][а-я]+$' GROUP BY ОТЧЕСТВО) AS unique_fathersname;

SELECT Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД FROM Н_ГРУППЫ_ПЛАНОВ
JOIN Н_ПЛАНЫ ON Н_ПЛАНЫ.ИД = Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная'
GROUP BY Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
HAVING COUNT(Н_ГРУППЫ_ПЛАНОВ.ГРУППА) > 2;

SELECT Н_ЛЮДИ.ИД, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО, AVG(ОЦЕНКА::int) AS СРЕДНИЙБАЛЛ
FROM Н_ЛЮДИ
JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
AND Н_УЧЕНИКИ.ГРУППА = '4100'
JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
AND ОЦЕНКА ~ '^[0-9]$'
GROUP BY Н_ЛЮДИ.ИД, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО
HAVING AVG(ОЦЕНКА::int) < (SELECT MIN(OTHER.MARK)
FROM (
SELECT AVG(ОЦЕНКА::int) AS MARK
FROM Н_ВЕДОМОСТИ
JOIN Н_УЧЕНИКИ USING ("ЧЛВК_ИД")
WHERE Н_УЧЕНИКИ.ГРУППА = '1101'
AND ОЦЕНКА ~ '^[0-9]$'
) OTHER);

SELECT ГРУППА, Н_УЧЕНИКИ.ИД, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО, П_ПРКОК_ИД, СОСТОЯНИЕ FROM Н_УЧЕНИКИ
JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ПЛАНЫ ON Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ IN ('Очная', 'Заочная')
AND Н_УЧЕНИКИ.НАЧАЛО > '2012-09-01'::timestamp
AND EXISTS (
    SELECT 1
    FROM Н_ПЛАНЫ
    WHERE Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
    AND Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
);

SELECT ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО FROM Н_ЛЮДИ
LEFT JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_УЧЕНИКИ.ЧЛВК_ИД IS NULL;
